In [1]:
import pandas as pd

In [37]:
#딕터셔리 타입으로 데이터 스트럭쳐 만들기
dict1 = {
'name' : ['김기훈', '이유진', '박동현', '김민지'],
'english' : [90, 80, 60, 70],
'math' : [50, 60, 100, 20]}
df1 = pd.DataFrame(df1)
df1

  name  english  math
0  김기훈       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [7]:
dict2 ={'번호':[1,2,3], 
        '성별':['남자','여자','남자'],
        '연령':[26,42,27],
        '연봉':['2,700만','4,000만','3,200만'],
        '출신지':['서울','부산','대전'],
        '전공':['경영','심리','사회']
       }
df2=pd.DataFrame(dict2)

In [8]:
df2

   번호  성별  연령      연봉 출신지  전공
0   1  남자  26  2,700만  서울  경영
1   2  여자  42  4,000만  부산  심리
2   3  남자  27  3,200만  대전  사회

In [9]:
df2.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
df2.values

array([[1, '남자', 26, '2,700만', '서울', '경영'],
       [2, '여자', 42, '4,000만', '부산', '심리'],
       [3, '남자', 27, '3,200만', '대전', '사회']], dtype=object)

In [11]:
#컬럼 '연령' 시리즈 추출
s1 =df2['연령']
s1

0    26
1    42
2    27
Name: 연령, dtype: int64

In [19]:
type(df2['연령'])

pandas.core.series.Series

In [21]:
#시리즈를 데이터프레임으로 변경할 땐 [] 괄호 한번 더 해서 이중괄호
s1 =df2[['연령']]
s1

   연령
0  26
1  42
2  27

In [12]:
# df2에서 컬럼 '연령'의 합 계산 (빌트인 sum함수)
sum(df2['연령'])

95

In [14]:
# df2에서 컬럼 '연령'의 합 계산 (시리즈에서 제공하는 메소드)
df2['연령'].sum()

95

In [15]:
# '연령' 평균 값 계산
df2['연령'].sum()/df2['연령'].count()

31.666666666666668

In [17]:
df2['연령'].sum()/3

31.666666666666668

In [18]:
df2['연령'].mean()

31.666666666666668

In [39]:
df1[['english', 'math']] >70

   english   math
0     True  False
1     True  False
2    False   True
3    False  False

In [44]:
ex3 = {'제품':['사과','딸기','수박'],
         '가격':[1800,1500,3000],
        '판매량':[24,38,13]}
df03 = pd.DataFrame(ex3)
df03

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [45]:
# 과일의 가격 평균

df03['가격'].mean()

2100.0

In [46]:
#판매량 평균

df03['판매량'].mean()

25.0

In [49]:
df04 = pd.DataFrame([[1800,24],[1500,38],[3000,13]],
                columns=['가격','판매량'],
                  index = ['사과','딸기','수박'])
df04

      가격  판매량
사과  1800   24
딸기  1500   38
수박  3000   13

## Lab 2 : 데이터 프레임 만들기

In [40]:
# Data Frame 생성(컬럼 이름과 인덱스 이름을 명시적으로 지정)
df2 = pd.DataFrame([[90, 50], [80, 60], [60, 100], [70, 20]],
columns = ['english', 'math'],
index = ['김기훈', '이유진', '박동현', '김민지'])
df2

     english  math
김기훈       90    50
이유진       80    60
박동현       60   100
김민지       70    20

In [41]:
df2>50

     english   math
김기훈     True  False
이유진     True   True
박동현     True   True
김민지     True  False

In [43]:
(df2>50).sum()

english    4
math       2
dtype: int64

## Lab3: 외부데이터 이용하기
* 분석할 데이터를 엑셀 데이터에서 가져 오기 (https://bit.ly/doit_python)
* pd.read_excel('excel_exam.xlsx')
* 첫번째 행을 컬럼으로 지정하고, 인덱스는 0부터 할당됨
* 특정 컬럼을 인덱스로 만들기 위해서는 set_index() 함수 사용

In [54]:
df_exam = pd.read_excel('excel_exam.xlsx')
# df_exam = pd.read_excel('excel_exam.xlsx',header=None) 
#헤더가 없을 경우= 컬럼명이 없이 다 데이터인경우 컬럼명 인덱스가 숫자로 들어감

# df_exam = pd.read_excel('excel_exam.xlsx',header=3)  
# 헤더가 3줄이고 4번째 줄부터 데이터일 경우 4줄이 컬럼명으로 시작

df_exam.head() # 맨 위 5개 데이터만 보기

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

## Lab 5 엑셀의 첫번째 행이 변수명(컬럼 이름)이 아닌 경우

In [57]:
pd_excel_exam_novar = pd.read_excel('excel_exam_novar.xlsx')
pd_excel_exam_novar.head()

   1  1.1  50  98  50.1
0  2    1  60  97    60
1  3    2  25  80    65
2  4    2  50  89    98
3  5    3  20  98    15
4  6    3  50  98    45

In [58]:
pd_excel_exam_novar = pd.read_excel('excel_exam_novar.xlsx', header = None)
pd_excel_exam_novar.head()

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15

In [60]:
# 데이터 프레임 pd_excel_exam_novar의 컬럼명을 별도로 지정함
pd_excel_exam_novar.columns = ['id', 'nclass', 'math', 'english', 'science']
pd_excel_exam_novar.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       2    25       80       65
3   4       2    50       89       98
4   5       3    20       98       15

In [62]:
# 데이터 프레임 pd_excel_exam_novar의 index를 컬럼 id로 지정함
pd_excel_exam_novar.set_index('id')

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        2    25       80       65
4        2    50       89       98
5        3    20       98       15
6        3    50       98       45
7        4    46       98       65
8        4    48       87       12

In [63]:
pd_excel_exam_novar

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       2    25       80       65
3   4       2    50       89       98
4   5       3    20       98       15
5   6       3    50       98       45
6   7       4    46       98       65
7   8       4    48       87       12

In [64]:
# 다시한번 저장하거나 
# pd_excel_exam_novar=pd_excel_exam_novar.set_index('id')

#inplace = True를 써서 저장
pd_excel_exam_novar.set_index('id', inplace=True)

In [65]:
pd_excel_exam_novar

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        2    25       80       65
4        2    50       89       98
5        3    20       98       15
6        3    50       98       45
7        4    46       98       65
8        4    48       87       12

## Lab 6 : CSV 파일 불러오기

In [70]:
import pandas as pd
df_exam_csv = pd.read_csv('exam.csv')
df_exam_csv.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [71]:
df_exam_csv.to_csv('0115.csv')